app/controllers/home_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."is_published" = 't' AND "pages"."featured" = 't'  ORDER BY "pages"."order" ASC
---
  def show
	@featured_pages = Page.where(is_published: true).where(featured: true).order(:order)